tutorials/verificationAndValidation/radiation-delete/2-infinite-cylinder-Cai-Modest-2016/1-full/setups.orig/common/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2301                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-5;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   1e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.7;

maxDi           0.25;

maxDeltaT       0.01;

functions
{
    sets1
    {
        type                sets;
        libs                (sampling);
        interpolationScheme cellPoint;
        setFormat           raw;
        executeControl      onEnd;
        writeControl        onEnd;

        fields              ( G );

        sets
        {
            r
            {
                type        uniform;
                axis        distance;
                start       (0 0 49.5);
                end         (1 0 49.5);
                nPoints     100;
            }
        }
    }
}

// ************************************************************************* //
